; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v5 - type_1 ?v6 - type_3)
 	      (pred_4 ?v4 - object ?v6 - type_3)
	      (pred_1 ?v5 - type_1 ?v2 - type_2)
	      (pred_3 ?v5 - type_1 ?v4 - object ?v2 - type_2))

   (:action op_1
       :parameters  (?v5 - type_1 ?v1 ?v8 - type_3)
       :precondition (and  (pred_2 ?v5 ?v1))
       :effect (and  (pred_2 ?v5 ?v8)
		     (not (pred_2 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v3 - object ?v7 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v7) (pred_2 ?v5 ?v7) (pred_1 ?v5 ?v2))
       :effect (and (pred_3 ?v5 ?v3 ?v2)
		    (not (pred_4 ?v3 ?v7)) 
		    (not (pred_1 ?v5 ?v2))))

   (:action op_3
       :parameters (?v5 - type_1 ?v3 - object ?v7 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v3 ?v2) (pred_2 ?v5 ?v7))
       :effect (and (pred_4 ?v3 ?v7)
		    (pred_1 ?v5 ?v2)
		    (not (pred_3 ?v5 ?v3 ?v2)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_05 obj_01 - type_1
obj_07 obj_10 obj_06 obj_02 - type_2
obj_03 obj_08 obj_11 - type_3
obj_09 obj_04 - object)
(:init
(pred_2 obj_05 obj_03)
(pred_1 obj_05 obj_07)
(pred_1 obj_05 obj_10)
(pred_2 obj_01 obj_11)
(pred_1 obj_01 obj_06)
(pred_1 obj_01 obj_02)
(pred_4 obj_09 obj_08)
(pred_4 obj_04 obj_11)
)
(:goal
(and
(pred_4 obj_09 obj_08)
(pred_4 obj_04 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_03) (pred_2 obj_01 obj_03))))
  )
)
)

; plan
1. (op_2 obj_01 obj_04 obj_11 obj_02)
   deleted: (pred_4 obj_04 obj_11) (pred_1 obj_01 obj_02)
   added: (pred_3 obj_01 obj_04 obj_02)
   goals met: 1 of 2
2. (op_1 obj_05 obj_03 obj_08)
   deleted: (pred_2 obj_05 obj_03)
   added: (pred_2 obj_05 obj_08)
   goals met: 1 of 2
3. (op_1 obj_01 obj_11 obj_03)
   deleted: (pred_2 obj_01 obj_11)
   added: (pred_2 obj_01 obj_03)
   goals met: 1 of 2
4. (op_3 obj_01 obj_04 obj_03 obj_02)
   deleted: (pred_3 obj_01 obj_04 obj_02)
   added: (pred_4 obj_04 obj_03) (pred_1 obj_01 obj_02)
   goals met: 2 of 2
